{
    "HERO_NAME": "Sercan Turhan",
    "HERO_TITLE": "Software Engineer",
    "HERO_DOWNLOAD_CV": "Download CV",
    "HERO_IMAGE_ALT": "Sercan Turhan",
    "HERO_CONTENT": "I have experience in building robust and scalable web applications. On the frontend, I work with React, while on the backend, I utilize technologies like Node.js and PHP. For database management, I have worked with PostgreSQL and MongoDB in various projects. My goal is to further enhance my skills and develop innovative projects and solutions. With my passion for technology and a commitment to continuous learning, I aim to create powerful software products through both individual efforts and collaborative teamwork. I see every new project as an opportunity to grow and move one step closer to excellence.",
    "ABOUT_TITLE": "About",
    "ABOUT_SUBTITLE": "Me",
    "ABOUT_TEXT": "Hello, my name is Sercan Turhan, and I am 24 years old. I graduated from the Computer Engineering Department of Ondokuz Mayıs University in July 2023. My passion for the software world began to take shape during my university years, and I aim to carry the knowledge and experience I gained during this time forward in my career. Currently, I am working as a Software Engineer at the Ministry of National Education since April 2024. With my interest in technology and problem-solving skills, I continue to develop innovative solutions in the field of software development. I am motivated by a desire to continuously improve myself, explore new technologies, and contribute to the software world. With my past experiences and future aspirations, I aim to enhance both my professional and personal growth.",
    "EXPERIENCE_TITLE": "Experience",
    "TECHNOLOGIES": "Technologies",
    "EXPERIENCES": [
      {
        "year": "2024 - Present",
        "role": "Software Engineer",
        "company": "Ministry of National Education",
        "description": "As a Junior Software Engineer, I develop full-stack web applications, utilizing the PHP Symfony framework for various projects. I primarily work with PostgreSQL as the database solution, ensuring efficient and scalable data management. During this time, I have also gained hands-on experience with Docker, enhancing my skills in containerization and deployment processes. This role has allowed me to grow technically while contributing to diverse and impactful projects.",
        "technologies": ["Javascript", "Php", "PostgreSQL", "Docker"]
      },
      {
        "year": "2022",
        "role": "Frontend Developer",
        "company": "Tiga Technology",
        "description": "I completed an internship as a Frontend Developer at Tiga Technology, where I focused on developing user interfaces using HTML, CSS, and React. During this time, I worked on creating responsive and visually appealing web designs, ensuring a seamless user experience. Additionally, I gained experience working with REST APIs, integrating frontend applications with backend systems to deliver dynamic and interactive features. This internship provided me with valuable insights into frontend development practices and strengthened my skills in building efficient web interfaces.",
        "technologies": ["HTML", "CSS", "Javascript", "React"]
      }
    ],
    "PROJECTS_TITLE": "Projects",
    "PROJECTS": [
      {
        "title": "Hotel Management Dashboard",
        "link": "https://sercanturhan-react-hotelmanagement.netlify.app",
        "image": "/projects/project-1.png",
        "description": "This project is a hotel management dashboard application built with React. It provides a user-friendly interface for managing hotel operations, utilizing modern technologies like React Query, React Router DOM, useForm, and Supabase for the backend.",
        "technologies": ["React", "React Query", "React Router DOM", "Supabase"]
      },
      {
        "title": "Pizza App 🍕",
        "link": "https://sercanturhan-react-pizzaap.netlify.app",
        "image": "/projects/project-2.png",
        "description": "This is a pizza ordering app built using React and Redux. Users can browse a menu of pizzas and add them to their cart. The cart management is handled with Redux, and the app is styled using Tailwind CSS.",
        "technologies": ["React", "Redux", "Tailwind CSS"]
      },
      {
        "title": "Hotel Reservation Website",
        "link": "https://sercanturhan-nextjs-website.vercel.app/",
        "image": "/projects/project-3.png",
        "description": "This project is a hotel reservation web application built using Next.js. Users can view available rooms, make reservations, and sign in using Google Authentication. The design is implemented using Tailwind CSS for a responsive and modern UI.",
        "technologies": ["React", "Next.js", "Tailwind CSS", "Google Authentication"]
      },
      {
        "title": "CSS Animations with Sass",
        "link": "https://sercanturhan-css-animations.netlify.app",
        "image": "/projects/project-4.png",
        "description": "This project showcases various CSS animations created using Sass to enhance the maintainability and structure of the styles. The animations cover different visual effects and transitions, demonstrating the power of CSS combined with Sass for managing complex styles.",
        "technologies": ["HTML5", "Sass (SCSS)", "CSS Animations"]
      },
      {
        "title": "CSS Grid Project",
        "link": "https://sercanturhan-css-grid.netlify.app",
        "image": "/projects/project-5.png",
        "description": "This project is a demonstration of layout design using CSS Grid and Sass. It showcases various grid-based layouts, offering responsive and visually appealing designs.",
        "technologies": ["HTML5", "Sass (SCSS)", "CSS Grid"]
      }
    ],
    "CONTACT_TITLE": "Get in Touch",
    "CONTACT": {
      "address": "Ankara, Turkey",
      "phoneNo": "+90 545 747 8638",
      "email": "sercann.turhan@gmail.com"
    }
  }
  